<?php

use yii\helpers\Console;
use yii\db\Migration;
use yii\db\Expression;
use admapp\Util\Core;
use app\models\User;

class m160224_100004_populate_core_data extends Migration
{

    public function safeDown()
    {
        Console::stdout("Deleting core parameters (specialisation).\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->delete("{$this->db->tablePrefix}specialisation")->execute();

        Console::stdout("Deleting core parameters (employee status).\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->delete("{$this->db->tablePrefix}employee_status")->execute();

        Console::stdout("Deleting core parameters (positions).\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->delete("{$this->db->tablePrefix}position")->execute();

        Console::stdout("Deleting core admin user.\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->delete("{$this->db->tablePrefix}user", 'id = :id', [':id' => 1])->execute();
    }

    public function safeUp()
    {
        Console::stdout("Creating core admin user.\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->insert("{$this->db->tablePrefix}user", [
            'id' => 1,
            'username' => 'admin',
            'auth_key' => '',
            'password_hash' => '$2y$13$TrWrgr18LihofvDhzlI3I.XqKe2KfyWiRBRarzi1fJuURqh9oQGHq',
            'password_reset_token' => Core::generateToken(10),
            'email' => 'spapad@gmail.com',
            'name' => 'Stavros',
            'surname' => 'Papadakis',
            'status' => User::STATUS_ACTIVE, // 10
            'last_login' => null,
            'create_ts' => new Expression('CURRENT_TIMESTAMP'),
            'update_ts' => new Expression('CURRENT_TIMESTAMP')
        ])->execute();

        Console::stdout("Setting auto increment for new users to 10.\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand("alter table `{$this->db->tablePrefix}user` AUTO_INCREMENT=10;")
                ->execute();

        Console::stdout("Creating core parameters (positions).\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->batchInsert("{$this->db->tablePrefix}position", ['id', 'name', 'comments'], [
            [1, 'Εκπαιδευτικός', ''],
            [2, 'Υποδιευθυντής', ''],
            [3, 'Δ/ντής', ''],
            [4, 'Προϊστάμενος', ''],
            [5, 'Τμ.Ένταξης', ''],
            [6, 'Διοικητικός', ''],
            [7, 'Ιδιωτικός', ''],
        ])->execute();
        Console::stdout("Setting auto increment to 8.\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand("alter table `{$this->db->tablePrefix}position` AUTO_INCREMENT=8;")
                ->execute();

        Console::stdout("Creating core parameters (employee status).\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->batchInsert("{$this->db->tablePrefix}employee_status", ['id', 'name'], [
            [1, 'Εργάζεται'],
            [2, 'Λύση σχέσης - Παραίτηση'],
            [3, 'Άδεια'],
            [4, 'Διαθεσιμότητα'],
        ])->execute();
        Console::stdout("Setting auto increment to 5.\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand("alter table `{$this->db->tablePrefix}employee_status` AUTO_INCREMENT=5;")
                ->execute();

        Console::stdout("Creating core parameters (specialisation).\n", Console::FG_YELLOW);
        Yii::$app->db->createCommand()->batchInsert("{$this->db->tablePrefix}specialisation", ['code', 'name'], [
            ['ΔΕ [μ]', 'Μετακλητός - ΔΕ'],
            ['ΔΕ [ι]', 'Ιδιώτης μέλος επιτροπών - ΔΕ'],
            ['ΔΕ 0100', 'Διοικητικός'],
            ['ΔΕ 0101', 'Ηλεκτροτεχνίτης'],
            ['ΔΕ 0102', 'Μηχανοτεχνίτης'],
            ['ΔΕ 0104', 'Ηλεκτρονικός'],
            ['ΔΕ 0105', 'Οικοδόμος'],
            ['ΔΕ 0106', 'Εμπειρικός Μηχαν/γός'],
            ['ΔΕ 0107', 'Εμπειρικός Ηλεκτρολόγος'],
            ['ΔΕ 0108', 'Ηλεκτροσυγκολητής'],
            ['ΔΕ 0109', 'Βοηθός Χημικού'],
            ['ΔΕ 0110', 'Τεχνίτης Αυτοκινήτων'],
            ['ΔΕ 0111', 'Τεχνίτης Ψύξεως'],
            ['ΔΕ 0112', 'Υδραυλικός'],
            ['ΔΕ 0113', 'Ξυλουργός'],
            ['ΔΕ 0114', 'Κοπτικής Ραπτικής '],
            ['ΔΕ 0115', 'Αργυροχρυσοχοιας'],
            ['ΔΕ 0116', 'Τεχν. Αμαξωματων'],
            ['ΔΕ 0117', 'Κομμωτικής'],
            ['ΔΕ 0131', 'Ειδικό Βοηθητικό Προσωπικό'],
            ['ΔΕ 0132', 'Οδηγοί-Συνοδοί'],
            ['ΔΕ 0200', 'Δακτυλογράφος'],
            ['ΔΕ 0300', 'Διοικητικός ΔΕ2'],
            ['ΔΕ 1300', 'Συντηρητής'],
            ['ΕΜ1', 'Κινηματογράφου'],
            ['ΕΜ1600', 'Μουσικής Εμπειροτέχνης'],
            ['ΕΜ2', 'Κλασσικού Χορού'],
            ['ΕΜ3', 'Κίνηση-Χορού'],
            ['ΕΜ4', 'Σύγχρονου Χορού'],
            ['ΠΕ', 'Ιδιώτης μέλος επιτροπών - ΠΕ'],
            ['ΠΕ 0100', 'Διοικητικός'],
            ['ΠΕ 0101', 'Θεολόγος'],
            ['ΠΕ 0102', 'Διοικητικός'],
            ['ΠΕ 0201', 'Φιλόλογος'],
            ['ΠΕ 0301', 'Μαθηματικός'],
            ['ΠΕ 0401', 'Φυσικός'],
            ['ΠΕ 0402', 'Χημικός'],
            ['ΠΕ 0403', 'Φυσιογνώστης'],
            ['ΠΕ 0404', 'Βιολόγος'],
            ['ΠΕ 0405', 'Γεωλόγος'],
            ['ΠΕ 0501', 'Γαλλ. Γλώσσας'],
            ['ΠΕ 0601', 'Αγγλ. Γλώσσας'],
            ['ΠΕ 0701', 'Γερμ. Γλώσσας'],
            ['ΠΕ 0801', 'Καλλιτεχν. Μαθημάτων'],
            ['ΠΕ 0901', 'Οικονομολόγος'],
            ['ΠΕ 1001', 'Κοινωνιολόγος με ΣΕΛΕΤΕ'],
            ['ΠΕ 1002', 'Κοινωνιολόγος'],
            ['ΠΕ 1101', 'Φυσικής Αγωγής'],
            ['ΠΕ 1201', 'Πολιτικός Μηχανικός'],
            ['ΠΕ 1202', 'Αρχιτέκτονας'],
            ['ΠΕ 1203', 'Τοπογράφος'],
            ['ΠΕ 1204', 'Μηχανολόγος'],
            ['ΠΕ 1205', 'Ηλεκτρολόγος'],
            ['ΠΕ 1206', 'Ηλ/κος Μηχανικός'],
            ['ΠΕ 1208', 'Χημικός Μηχανικός'],
            ['ΠΕ 1210', 'Φυσικός Ραδ/γος'],
            ['ΠΕ 1211', 'Μηχανικός Παραγωγής και Διοίκησης'],
            ['ΠΕ 1301', 'Νομικών-Πολιτικών Επιστημών'],
            ['ΠΕ 1401', 'Ιατρός'],
            ['ΠΕ 1402', 'Οδοντογιατρός'],
            ['ΠΕ 1403', 'Φαρμακοποιός 5ετους'],
            ['ΠΕ 1404', 'Γεωπόνος'],
            ['ΠΕ 1405', 'Δασολογίας-Φυσ. Περιβάλλοντος'],
            ['ΠΕ 1406', 'Νοσηλευτικής'],
            ['ΠΕ 1407', 'Φαρμακοποιός 4ετους'],
            ['ΠΕ 1501', 'Οικ. Οικονομίας'],
            ['ΠΕ 1601', 'Μουσικής (ΠΕ)'],
            ['ΠΕ 1602', 'Μουσικής (Ωδείο/TEI)'],
            ['ΠΕ 1701', 'Τεχν. Πολ. Μηχαν. ΑΣΕΤΕΜ'],
            ['ΠΕ 1702', 'Τεχν. Μηχανολόγος ΑΣΕΤΕΜ'],
            ['ΠΕ 1703', 'Τεχν. Ηλεκτρ/γος ΑΣΕΤΕΜ'],
            ['ΠΕ 1704', 'Τεχν. Ηλεκτρ/κός ΑΣΕΤΕΜ'],
            ['ΠΕ 1705', 'Τεχν. Πολ/κός Μηχ/κός ΤΕΙ'],
            ['ΠΕ 1706', 'Τεχν. Μηχ/λόγος ΤΕΙ'],
            ['ΠΕ 1707', 'Τεχν. Μηχ/ργός ΤΕΙ'],
            ['ΠΕ 1708', 'Τεχν. Ηλεκτρ/κός ΤΕΙ'],
            ['ΠΕ 1709', 'Τεχνολόγοι Ιατρικών Οργάνων'],
            ['ΠΕ 1710', 'Τεχνολόγοι Ενεργειακής Τεχνικής'],
            ['ΠΕ 1711', 'Τοπογράφοι ΤΕΙ ΚΑΤΕΕ'],
            ['ΠΕ 1801', 'Γραφικών Τεχνών'],
            ['ΠΕ 1802', 'Διοικ. Επιχειρήσεων'],
            ['ΠΕ 1803', 'Λογιστικής'],
            ['ΠΕ 1804', 'Αισθητικής'],
            ['ΠΕ 1807', 'Ιατρ. Εργαστηρίων'],
            ['ΠΕ 1808', 'Οδοντοτεχνικής'],
            ['ΠΕ 1809', 'Κοινωνικής Εργασίας'],
            ['ΠΕ 1810', 'Νοσηλευτικής'],
            ['ΠΕ 1811', 'Μαιευτική'],
            ['ΠΕ 1812', 'Φυτικής Παραγωγής'],
            ['ΠΕ 1813', 'Ζωικής Παραγωγής'],
            ['ΠΕ 1814', 'Ιχθυοκομίας-Αλιείας'],
            ['ΠΕ 1815', 'Γεωργικών Μηχ/των'],
            ['ΠΕ 1816', 'Δασοπονίας'],
            ['ΠΕ 1817', 'Διοίκ. Γεωργ. Εκμ/σεων'],
            ['ΠΕ 1818', 'Οχημάτων ΤΕΙ'],
            ['ΠΕ 1819', 'Στατιστικής'],
            ['ΠΕ 1820', 'Κλωστοϋφαντουργίας'],
            ['ΠΕ 1821', 'Ραδ/γίας & Ακτιν/γίας'],
            ['ΠΕ 1822', 'Μεταλλειολόγος'],
            ['ΠΕ 1823', 'Ναυτικών Μαθημάτων'],
            ['ΠΕ 1824', 'Εργασιοθεραπείας'],
            ['ΠΕ 1825', 'Φυσιοθεραπείας'],
            ['ΠΕ 1826', 'Γραφιστικής'],
            ['ΠΕ 1827', 'Διακοσμητικής'],
            ['ΠΕ 1828', 'Συν/σης Αρχ. & Εργ. Τέχνης'],
            ['ΠΕ 1829', 'Φωτογραφίας'],
            ['ΠΕ 1830', 'Εργοδ. Θερμοκηπιακών Καλ/γιών'],
            ['ΠΕ 1831', 'Μηχανικός Εμπορικού Ναυτικού'],
            ['ΠΕ 1832', 'Μηχανοσυνθέτης Αεροσκαφών'],
            ['ΠΕ 1833', 'Βρεφονηπιοκόμος'],
            ['ΠΕ 1834', 'Αργυροχρυσοχοίας'],
            ['ΠΕ 1835', 'Τουριστικών Επιχειρήσεων'],
            ['ΠΕ 1836', 'Τεχνολόγος Τροφίμων-Διατροφής'],
            ['ΠΕ 1837', 'Δημόσιας Υγιεινής'],
            ['ΠΕ 1838', 'Κεραμικής'],
            ['ΠΕ 1839', 'Επισκεπτριών Υγείας'],
            ['ΠΕ 1840', 'Εμπορίας και Διαφήμισης (Marketing)'],
            ['ΠΕ 1841', 'Δραματικής Τέχνης'],
            ['ΠΕ 1901', 'Πληροφορικής'],
            ['ΠΕ 1902', 'Εφαρμοσμένης Πληροφορικής'],
            ['ΠΕ 1903', 'Πληροφορικής (ΠΕ5)'],
            ['ΠΕ 2001', 'Πληροφορικής ΤΕΙ'],
            ['ΠΕ 2002', 'Πληροφορικής'],
            ['ΠΕ 2101', 'Θεραπευτής Λόγου'],
            ['ΠΕ 2126', 'Λογοθεραπευτής'],
            ['ΠΕ 2300', 'Ψυχολόγος'],
            ['ΠΕ 2400', 'Παιδοψυχίατρος Ειδικό Εκπαιδευτικό Προσωπικό'],
            ['ΠΕ 2500', 'Σχολική νοσηλεύτρια'],
            ['ΠΕ 2600', 'Λογοθεραπευτής'],
            ['ΠΕ 2800', 'Φυσικοθεραπευτών'],
            ['ΠΕ 2900', 'Εργοθεραπευτών'],
            ['ΠΕ 3000', 'Ειδικό  Προσωπικό'],
            ['ΠΕ 3001', 'Κοινωνικοί Λειτουργοί'],
            ['ΠΕ 3200', 'Θεατρικών Σπουδών'],
            ['ΠΕ 3201', 'Θεατρικών Σπουδών'],
            ['ΠΕ 3300', 'Μεθοδολογίας'],
            ['ΠΕ 3400', 'Ιταλ. Γλώσσας'],
            ['ΠΕ 4', 'Μετακλητός-Πτυχίο ΑΕΙ'],
            ['ΠΕ 4000', 'Ισπ. Γλώσσας'],
            ['ΠΕ 5', 'Μετακλητός-Πτυχίο ΑΕΙ'],
            ['ΠΕ 6', 'Μετακλητός-Πτυχίο ΑΕΙ'],
            ['ΠΕ 6000', 'Νηπιαγωγός'],
            ['ΠΕ 6100', 'Νηπιαγωγός Ειδικής Αγωγής'],
            ['ΠΕ 7000', 'Δάσκαλος'],
            ['ΠΕ 7100', 'Δάσκαλος Ειδικής Αγωγής'],
            ['ΠΕ 73', 'Εκπ/κοί Μεειονοτικού Προγ/τος Μειονοτικών Σχολείων'],
            ['ΤΕ 0001', 'Διοικητικός ΤΕ1'],
            ['ΤΕ 0010', 'Ειδικό Προσωπικό'],
            ['ΤΕ 0011', 'Πληροφορικής'],
            ['ΤΕ 0100', 'Διοικητικός ΤΕ3'],
            ['ΤΕ 0101', 'Εργοδ. Σχεδιαστής'],
            ['ΤΕ 0102', 'Εργοδ. Μηχανολόγος'],
            ['ΤΕ 0103', 'Εργοδ. Μηχ/κος Αυτοκινήτων'],
            ['ΤΕ 0104', 'Εργοδ. Ψυκτικός'],
            ['ΤΕ 0105', 'Εργοδ. Δομικός'],
            ['ΤΕ 0106', 'Εργοδ. Ηλεκτρολόγος'],
            ['ΤΕ 0107', 'Εργοδ. Ηλεκτρονικός'],
            ['ΤΕ 0108', 'Εργοδ. Χημικός Εργαστηρίων'],
            ['ΤΕ 0109', 'Εργοδ. Μηχ/κος Εμπ. Ναυτικού'],
            ['ΤΕ 0110', 'Εργοδ. Υπάλληλος Γραφείου'],
            ['ΤΕ 0111', 'Εργοδ. Υπάλληλος Λογιστηρίου'],
            ['ΤΕ 0112', 'Εργοδ. Διακοσμητικής'],
            ['ΤΕ 0113', 'Εργοδ. Προγραμματιστής Η/Υ'],
            ['ΤΕ 0116', 'Μουσικής'],
            ['ΤΕ 0117', 'Συντ. Εργ. Τέχνης & Αρχ.'],
            ['ΤΕ 0119', 'Κομμωτικής'],
            ['ΤΕ 0120', 'Αισθητικής'],
            ['ΤΕ 0122', 'Εργοδ. Κοπτικής Ραπτικής'],
            ['ΤΕ 0123', 'Εργοδ. Μεταλλειολόγος'],
            ['ΤΕ 0124', 'Εργοδ. Ωρολογοποιίας'],
            ['ΤΕ 0125', 'Εργοδ. Αργυροχρυσοχοίας'],
            ['ΤΕ 0126', 'Εργοδ. Οδοντοτεχνικής'],
            ['ΤΕ 0127', 'Εργοδ. Κλωστοϋφαντουργίας'],
            ['ΤΕ 0128', 'Εργοδ. Αεροσκαφών'],
            ['ΤΕ 0129', 'Εργοδ. Βοηθ. Ιατρ. & Βιολ. Εργ.'],
            ['ΤΕ 0130', 'Βοηθός Βρεφοκόμος'],
            ['ΤΕ 0131', 'Χειριστής Ιατρικών Συσκευών'],
            ['ΤΕ 0133', 'Φυτικής Παραγωγής'],
            ['ΤΕ 0134', 'Ζωικής Παραγωγής'],
            ['ΤΕ 0201', 'Επιμελητής'],
            ['ΤΕ 0501', 'Φυσικοθεραπευτής'],
            ['ΤΕ 0701', 'Κοινωνικός Λειτουργός'],
            ['ΤΕ 1601', 'Μουσικοί από Ωδεία'],
            ['ΤΕ 4', 'Μετακλητός - Πτυχίο ΤΕΙ'],
            ['ΥΕ [μ]', 'Μετακλητός - ΥΕ'],
            ['ΥΕ 0110', 'Επιστάτης'],
            ['ΥΕ 0120', 'Κλητήρας'],
            ['ΥΕ 0130', 'Φύλακας-Νυκτοφύλακας'],
            ['ΥΕ 0140', 'Καθαρίστρια'],
        ])->execute();
    }

}
