<?php

use yii\db\Migration;

class m180529_111937_insert_help_page extends Migration
{
    public function safeUp()
    {
        $tbl_pages = $this->db->tablePrefix . 'page';
        $apphelp_content = '<h3>1. Προβολή και διαθέσιμες ενέργειες Εγκρίσεων Μετακινήσεων</h3>
        	<p>Για την προβολή των δημιουργημένων εγκρίσεων μετακινήσεων και την πρόσβαση στις αντίστοιχες λειτουργίες τους, από το μενού
        	"Σχολικές Μετακινήσεις" επιλέγουμε "Εγκρίσεις Μετακινήσεων".</p>
        	<p>Οι διαθέσιμες λειτουργίες είναι:</p>
        	<ul>
        		<li>Δημιουργία Μετακίνησης</li>
        		<li>Προβολή Μετακίνησης</li>
        		<li>Διαγραφή Μετακίνησης (η διαγραφή επιτρέπεται μόνο όταν η μετακίνηση βρίσκεται στην αρχική κατάσταση)</li>
        		<li>Λήψη αρχείου έγκρισης μετακίνησης</li>
        		<li>Λήψη ψηφιακά υπογεγραμμένου αρχείου έγκρισης μετακίνησης (μόνο εφόσον έχει μεταφορτωθεί)</li>
        		<li>Προώθηση σε επόμενη κατάσταση (κατά την προώθηση σε επόμενη κατάσταση εμφανίζεται σχετικό εικονίδιο πάνω στο οποίο 
        		όταν βρεθεί το ποντίκι εμφανίζονται πληροφορίες σχετικές με την συγκεκριμένη κατάσταση της μετακίνησης.</li>
        		<li>Μετάβαση σε προηγούμενη κατάσταση (με αυτή τη λειτουργία διαγράφονται όλες οι πληροφορίες που είναι σχετικές 
        		με αυτή την κατάσταση)</li>
        		<li>Αρχειοθέτηση έγκρισης μετακίνησης</li>
        		<li>Επαναφορά έγκρισης μετακίνησης από αρχειοθέτηση</li>
        	</ul>
        	<hr />
            <h3>2. Δημιουργία Έγκρισης Μετακίνησης</h3>
            Για τη δημιουργία Έγκρισης Σχολικής Μετακίνησης:
                <ul> 
                    <li>πηγαίνουμε στο μενού "Σχολικές Μετακινήσεις" και επιλέγουμε "Εγκρίσεις Μετακινήσεων" όπου βλέπουμε όλες τις εγκρίσεις 
                    μετακινήσεων που έχουν δημιουργηθεί,</li> 
                    <li>πατάμε το κουμπί "Δημιουργία Μετακίνησης" και στο πάνελ που εμφανίζεται επιλέγουμε τον τύπο της Σχολικής Μετακίνησης
                    που θέλουμε να δημιουργήσουμε,</li>
                    <li>συμπληρώνουμε τη φόρμα με τα στοιχεία της μετακίνησης,</li>
                    <li>πατάμε το κουμπί "Δημιουργία" και η εφαρμογή επιστρέφει στο σημείο όπου εμφανίζονται όλες οι δημιουργημένες 
                    μετακινήσεις.</li> 
                </ul>
            <p>
            Για να εκτυπώσουμε την απόφαση της Έγκρισης πατάμε από την αντίστοιχη μετακίνηση το σύνδεσμο για το "κατέβασμα" του αρχείου.
            </p>
            <hr />
            <h3>3. Παράμετροι</h3>
            <h4>3.1. Σχολικές Μονάδες</h4>
            <p>Στο μενού "Σχολικές Μετακινήσεις" στην επιλογή "Σχολικές Μονάδες" μπορούμε να δούμε όλες τις σχολικές μονάδες που υπάρχουν
            αποθηκευμένες στη βάση δεδομένων της εφαρμογής. Πατώντας το κουμπί "Ενημέρωση Στοιχείων Σχολείων" αντλούνται τα στοιχεία των σχολείων
            από το MySchool και αυτά ενημέρωνονται στη βάση δεδομένων της εφαρμογής.</p>
            <p>  
            Τα ονόματα των σχολικών μονάδων αυτών χρησιμοποιούνται στη φόρμα της δημιουργίας 
            έγκρισης μετακίνησης στην οποία η εισαγωγή του σχολείου γίνεται από ένα πεδίο όπου αρκεί η αναζήτηση του σχολείου σε αυτό 
            (απλά εισάγοντας ένα μέρος του ονόματός του).            
            </p>
            <h4>3.2. Καταστάσεις Εγκρίσεων</h4>
            <p>Στο μενού "Σχολικές Μετακινήσεις" στην επιλογή "Καταστάσεις Εγκρίσεων" φαίνονται οι διαθέσιμες καταστάσεις μέσω των οποίων
            περνάει η διαδικασία Έγκρισης μιας Σχολικής Μετακίνησης από τη δημιουργία μέχρι και την διεκπεραίωσή της.</p>
            <p>Οι καταστάσεις αυτές είναι:</p>
            <ul>
                <li>Ψηφιακά Υπογεγραμμένη<i>(αν έχει δημιουργηθεί ψηφιακά υπογεγραμμένο αρχείο της έγκρισης)</i></li>
                <li>Πρωτοκολλήθηκε/Ξεχρεώθηκε</li>
                <li>Διεκπεραιώθηκε(αν η έγκριση έχει αποσταλεί)</li>
            </ul>
            <hr />
            <h3>3. Βοήθεια</h3>
            <h4>3.1. Βοήθεια εφαρμογής σχολικών μετακινήσεων</h4>
            <p>Στην ενότητα αυτή παρέχονται οδηγίες για τη χρήση της εφαρμογής των Σχολικών Μετακινήσεων</p>
            <h4>3.2. Διαδικασία έγκρισης σχολικής μετακίνησεις</h4>
            <p>Στην ενότητα αυτή παρέχονται οδηγίες για τα στοιχεία που πρέπει να ελεγχθούν στα δικαιολογητικά που έχουν παραληφθεί από
            τη Διεύθυνση Εκπαίδευσης του σχολείου που ζητάει την έγκριση μετακίνησης.</p>
            <h4>3.3. Νομοθεσία σχολικών μετακινήσεων</h4>
            <p>Στην ενότητα αυτή υπάρχουν τα αρχεία με τη νομοθεσία που είναι σχετική με τις σχολικές μετακινήσεις.</p> ';
        $insert_command = "INSERT INTO " . $tbl_pages . "(identity, title, content) VALUES ";
        Yii::$app->db->createCommand($insert_command . "('schtransport_apphelp', 'Βοήθεια σχετικά με την εφαρμογή των σχολικών μετακινήσεων.', '" 
                                                        . $apphelp_content . "')")->execute();
    
        $approvalhelp_content = '<p>Για την έγκριση μιας σχολικής μετακίνησης (εκτός αυτών που αφορούν το Σχολείο Ευρωπαϊκής Παιδείας) απαιτούνται τα ακόλουθα δικαιολογητικά
        που διαβιβάζονται στην Περιφερειακή Διεύθυνση Εκπαίδευσης μέσω της οικίας Διεύθυνσης Εκπαίδευσης του σχολείου:</p>
        <ol>
        	<li>Διαβιβαστικό με θετική εισήγηση από τη Διεύθυνση Εκπαίδευσης στην οποία ανήκει το σχολείο.</li>
        	<li>Αίτηση του σχολείου ή των εκπαιδευτικών που μετακινούνται.</li>
        	<li>Πρόσκληση από το φορέα υποδοχής προς τον οποίο γίνεται η μετακίνηση και στην οποία θα πρέπει να αναφέρονται τα ονόματα των
        	μετακινούμενων εκπαιδευτικών και μαθητών/τριών (εφόσον υπάρχουν).</li>
        	<li>Σύμβαση μεταξύ του σχολείου και του φορέα υποδοχής (αρκεί η 1η και τελευταία σελίδα) στην οποία αναφέρεται ο κωδικός του 
        	προγράμματος (αφορά προγράμματα Erasmus). <br />Εναλλακτικά αντί της Σύμβασης αρκεί και η αίτηση από το ΙΚΥ.</li> 
        	<li>Πρόγραμμα συνάντησης από τον φορέα υποδοχής (ελέγχουμε η έναρξη της μετακίνησης να είναι 1 μέρα πριν την έναρξη της συνάντησης και η λήξη 1 μέρα μετά τη λήξη της συνάντησης
        		για την οποία γίνεται η μετακίνηση.).</li>
        	<li>Πρακτικό Απόφασης Συλλόγου Διδασκόντων του σχολείου με το οποίο γίνεται ο καθορισμός της Παιδαγωγικής Ομάδας του προγράμματος.</li>
        	<li>Πρακτικό Απόφασης Συλλόγου Διδασκόντων του σχολείου για τη συγκεκριμένη μετακίνηση.</li>
        	<li>Διαβιβαστικό του σχολείου προς την οικία Διεύθυνση Εκπαίδευσης του σχολείου.</li>
        </ol>';
        $insert_command = "INSERT INTO " . $tbl_pages . "(identity, title, content) VALUES ";
        echo Yii::$app->db->createCommand($insert_command . "('schtransport_approvalhelp', 'Βοήθεια σχετικά με τη δημιουργία έγκρισης σχολικής μετακίνησης.', '"
                                        . $approvalhelp_content . "')")->execute();        
    }

    public function safeDown()
    {
        $tbl_pages = $this->db->tablePrefix . 'page';
        $delete_command = "DELETE FROM " . $tbl_pages . " WHERE identity='schtransport_apphelp'";
        Yii::$app->db->createCommand($delete_command)->execute();
        $delete_command = "DELETE FROM " . $tbl_pages . " WHERE identity='schtransport_approvalhelp'";
        Yii::$app->db->createCommand($delete_command)->execute();
    }
}