<?php
/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'Σχετικά';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <h1>Εφαρμογή υποστήριξης Διοικητικού έργου (έκδοση 1.0)</h1>
    <h1><small>Λειτουργία</small></h1>
    <p>Με τη βοήθεια της εφαρμογής μπορείτε να:</p>
	<ul>
        <li>καταγράψετε το προσωπικό της υπηρεσίας (εργαζόμενοι) και αναλυτικά τα στοιχεία που τους αφορούν.</li>
        <li>καταχωρήσετε ειδικότητες, υπηρεσίες, θέσεις και καταστάσεις για τους υπαλλήλους.</li>
        <li>συσχετίσετε αρχεία αδειών με τους τύπους άδειας που χορηγεί η υπηρεσία. </li>
        <li>χορηγήσετε άδειες για τους υπαλλήλους σας δημιουργώντας μέσω της εφαρμογής docx αρχεία που μπορείτε να μεταφορτώσετε στον υπολογιστή σας.</li>
        <li>αποστείλετε με email τις άδειες για τους υπαλλήλους σας (αυτόματα στο email του υπαλλήλου, της οργανικής θέσης και της θέσης που υπηρετεί, εφόσον έχουν οριστεί).</li>
        <li>δημιουργήσετε/τροποποιήσετε τους χρήστες της εφαρμογής.</li>
        <li>επικοινωνήσετε με το διαχειριστή της εφαρμογής μέσω της αντίστοιχης σελίδας Επικοινωνία.</li>      
    </ul>
    <h1><small>Εγγεγραμμένοι χρήστες</small></h1>
    <ul>
        <li>Οι εγγεγραμμένοι χρήστες του συστήματος καθορίζονται από το διαχειριστή και δεν είναι δυνατή η εγγραφή άλλων χρηστών.</li>
		<li>Εάν δεν διαθέτετε στοιχεία πρόσβασης δεν μπορείτε να αποκτήσετε πρόσβαση στην εφαρμογή.</li>
		<li>Εάν πιστεύετε ότι θα έπρεπε να αποκτήσετε πρόσβαση στην εφαρμογή, παρακαλώ επικοινωνήστε μαζί μας.</li>
	</ul>
    <h1>Ανάπτυξη και υποστήριξη</h1>
    <p>Ανάπτυξη και υποστήριξη <a href="http://kritis.pde.sch.gr" target="_blank" title="Περιφερειακή Διεύθυνση Πρωτοβάθμιας & Δευτεροβάθμιας Εκπαίδευσης Κρήτης">Περιφερειακή Διεύθυνση Πρωτοβάθμιας & Δευτεροβάθμιας Εκπαίδευσης Κρήτης</a></p>
    <ul>
        <li><a href="mailto:spapad@gmail.com">Σταύρος Παπαδάκης</a></li>
        <li><a href="mailto:sugarvag@gmail.com">Βαγγέλης Ζαχαριουδάκης</a></li>
        <li><a href="mailto:manpoul@gmail.com">Μάνος Πουλάκης</a></li>
    </ul>
    <p>Αξιοποιήθηκαν: </p>
    <ul>
        <li><a href="http://www.yiiframework.com/" target="_blank" title=Yii">Yii framework</a></li>
        <li><a href="http://getbootstrap.com/" target="_blank" title="Bootstrap">Bootstrap framework</a></li>
        <li><a href="http://www.mysql.com/" target="_blank" title="MySQL">MySQL</a></li>
    </ul>
    <p>Η υπηρεσία αυτή φιλοξενείται στο <a href="http://www.sch.gr" title="Πανελλήνιο Σχολικό Δίκτυο">Πανελλήνιο Σχολικό Δίκτυο</a>.</p>

</div>
